Revit 2027 API
Metal.MetalPatina Property
 The property labeled "Patina" from the "Metal" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MetalPatina { get; }
Public Shared ReadOnly Property MetalPatina As String
	Get
public:
static property String^ MetalPatina {
	String^ get ();
}
static member MetalPatina : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 1".
See Also
Reference
Metal Class
Autodesk.Revit.DB.Visual Namespace